In [1]:
import pandas as pd

### DataFrame

### (EX 1-4) Dictionary -> DataFrame

In [2]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

df = pd.DataFrame(dict_data)

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

### (Ex 1-5) List -> DataFrame

In [5]:
df = pd.DataFrame([
    [15,'남','여명중'],
    [17,'여','수리중']],
    index=['준서', '예은'],
    columns=['나이','성별','학교']
)

df

    나이 성별   학교
준서  15  남  여명중
예은  17  여  수리중

#### DataFrame Index/Columns Handling

In [6]:
df.index

Index(['준서', '예은'], dtype='object')

In [7]:
df.columns

Index(['나이', '성별', '학교'], dtype='object')

##### WARNING!!! Dictionary->DataFrame은 list가 column vector로 가지만 list->dataframe은 list가 row로 감!!!

#### Index/Column 이름 변경 - df.index df.columns

In [8]:
df.index = ['학생1','학생2']
df.columns= ['연령','남녀','소속']

In [9]:
df

     연령 남녀   소속
학생1  15  남  여명중
학생2  17  여  수리중

#### Index/Column 이름 변경 - df.rename

In [10]:
df.rename(index={'학생1':'준서','학생2':'예은'}, inplace=True) #new dataframe object을 반환!!! inplace 해야됨
df.rename(columns={'연령':'나이','남녀':'sex'}, inplace=True)

In [11]:
df

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중

### Drop Columns/Index

In [12]:
df

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중

In [13]:
df.drop('sex', axis=1)

    나이   소속
준서  15  여명중
예은  17  수리중

In [14]:
df.drop('준서', axis=0)

    나이 sex   소속
예은  17   여  수리중

In [15]:
df # inplace = True 해줘야됨!!

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중

In [16]:
df.drop(['sex','소속'],axis=1)

    나이
준서  15
예은  17

In [17]:
df

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중

### Index Copy

In [18]:
df3 = df.copy()

In [19]:
df3

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중

In [20]:
df3 = df[:]
df3

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중

### Row Selection - loc/iloc

In [21]:
exam_data = {'수학': [90,34,25], '영어':[93,93,32],'음악':[97,456,63],'체육':[100,20,30]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  93   97  100
우현  34  93  456   20
인아  25  32   63   30

In [23]:
df.loc[['서준','인아']]

    수학  영어  음악   체육
서준  90  93  97  100
인아  25  32  63   30

In [24]:
df.loc[['서준']]

    수학  영어  음악   체육
서준  90  93  97  100

In [25]:
df.loc['서준']

수학     90
영어     93
음악     97
체육    100
Name: 서준, dtype: int64

In [26]:
df.loc['서준':'인아']

    수학  영어   음악   체육
서준  90  93   97  100
우현  34  93  456   20
인아  25  32   63   30

In [27]:
df.iloc[0]

수학     90
영어     93
음악     97
체육    100
Name: 서준, dtype: int64

In [28]:
df.iloc[[0]]

    수학  영어  음악   체육
서준  90  93  97  100

In [31]:
df.iloc[[0,2]]

    수학  영어  음악   체육
서준  90  93  97  100
인아  25  32  63   30

In [32]:
df.iloc[0:2]

    수학  영어   음악   체육
서준  90  93   97  100
우현  34  93  456   20

### Row Selection

In [33]:
df

    수학  영어   음악   체육
서준  90  93   97  100
우현  34  93  456   20
인아  25  32   63   30

In [34]:
df['수학']

서준    90
우현    34
인아    25
Name: 수학, dtype: int64

In [35]:
df[['수학']]

    수학
서준  90
우현  34
인아  25

In [36]:
df[['수학','음악']]

    수학   음악
서준  90   97
우현  34  456
인아  25   63

In [40]:
df

    수학  영어   음악   체육
서준  90  93   97  100
우현  34  93  456   20
인아  25  32   63   30

In [43]:
df.loc[:,'영어':'음악']

    영어   음악
서준  93   97
우현  93  456
인아  32   63

In [49]:
data = {'이름':['서준','우현','인아'],'수학': [90,34,25], '영어':[93,93,32],'음악':[97,456,63],'체육':[100,20,30]}
df = pd.DataFrame(data)

In [50]:
df

   이름  수학  영어   음악   체육
0  서준  90  93   97  100
1  우현  34  93  456   20
2  인아  25  32   63   30

In [53]:
df.set_index('이름', inplace=True)

In [54]:
df

    수학  영어   음악   체육
이름
서준  90  93   97  100
우현  34  93  456   20
인아  25  32   63   30

In [55]:
df.loc['서준','음악']

97

In [56]:
df.iloc[0,2]

97

### Add Column

In [57]:
df

    수학  영어   음악   체육
이름
서준  90  93   97  100
우현  34  93  456   20
인아  25  32   63   30

In [58]:
df['국어']=80

In [59]:
df

    수학  영어   음악   체육  국어
이름
서준  90  93   97  100  80
우현  34  93  456   20  80
인아  25  32   63   30  80

In [60]:
df['섹스']=[10,20,30]

In [61]:
df

    수학  영어   음악   체육  국어  섹스
이름
서준  90  93   97  100  80  10
우현  34  93  456   20  80  20
인아  25  32   63   30  80  30

In [64]:
df.drop('섹스',axis=1, inplace=True)

In [65]:
df

    수학  영어   음악   체육  국어
이름
서준  90  93   97  100  80
우현  34  93  456   20  80
인아  25  32   63   30  80

### Add Row

In [66]:
df

    수학  영어   음악   체육  국어
이름
서준  90  93   97  100  80
우현  34  93  456   20  80
인아  25  32   63   30  80

In [67]:
df.loc['진기'] = df.loc['서준']
df

    수학  영어   음악   체육  국어
이름
서준  90  93   97  100  80
우현  34  93  456   20  80
인아  25  32   63   30  80
진기  90  93   97  100  80

### 원소값 변경

In [73]:
df.iloc[0][3]

100

In [75]:
df.iloc[0,3]

100

In [79]:
df.loc['서준']

수학     90
영어     93
음악     97
체육    100
국어     80
Name: 서준, dtype: int64

In [80]:
df.loc['서준','체육']

100

In [81]:
df.loc['서준']['체육']

100

In [85]:
df.loc['서준','음악':'체육'] = 88, 99

In [86]:
df

    수학  영어   음악   체육  국어
이름
서준  90  93   88   99  80
우현  34  93  456   20  80
인아  25  32   63   30  80
진기  90  93   97  100  80

In [87]:
df.T

이름  서준   우현  인아   진기
수학  90   34  25   90
영어  93   93  32   93
음악  88  456  63   97
체육  99   20  30  100
국어  80   80  80   80

In [88]:
df

    수학  영어   음악   체육  국어
이름
서준  90  93   88   99  80
우현  34  93  456   20  80
인아  25  32   63   30  80
진기  90  93   97  100  80